key.fr=\u0641\u064E\u0631\u064E\u0646\u0633\u064A\u0651
key.en=\u0625\u0646\u062C\u0644\u064A\u0632\u064A\u0651\u0629
key.ar=\u0639\u0631\u0628\u064A\u0629

key.language=\u0628\u0647 \u0632\u0628\u0627\u0646\u200C\u0647\u0627\u06CC \u062F\u06CC\u06AF\u0631
	
content=\
\u062C\u0627\u0648\u0627\u0627\u0641\u200C\u0627\u06A9\u0633 (\u0628\u0647 \u0627\u0646\u06AF\u0644\u06CC\u0633\u06CC: JavaFX) \u0633\u06A9\u0648\u06CC \u062C\u0627\u0648\u0627\u06CC\u06CC \u0627\u0633\u062A \u06A9\u0647 \u0628\u0631\u0627\u06CC \u062E\u0644\u0642 \u0648 \u062A\u062D\u0648\u06CC\u0644 \u06A9\u0627\u0631\u0628\u0631\u062F\u0647\u0627\u06CC \u063A\u0646\u06CC \u0627\u06CC\u0646\u062A\u0631\u0646\u062A\u06CC \u06A9\u0647 \u0628\u062A\u0648\u0627\u0646\u062F \u062F\u0631 \u067E\u0647\u0646\u0647\u0654 \u0648\u0633\u06CC\u0639\u06CC \u0627\u0632 \u062F\u0633\u062A\u06AF\u0627\u0647\u200C\u0647\u0627\u06CC \u0645\u062A\u0635\u0644 \u0628\u0647 \u0627\u06CC\u0646\u062A\u0631\u0646\u062A \u0627\u062C\u0631\u0627 \u06AF\u0631\u062F\u062F. \u062A\u06AF\u0627\u0631\u0634 \u06A9\u0646\u0648\u0646\u06CC \u0622\u0646 \u062A\u0648\u0633\u0639\u0647 \u062F\u0647\u0646\u062F\u06AF\u0627\u0646 \u0631\u0627 \u0642\u0627\u062F\u0631 \u0628\u0647 \u0633\u0627\u062E\u062A \u0628\u0631\u0646\u0627\u0645\u0647 \u0628\u0631\u0627\u06CC \u0645\u062D\u06CC\u0637\u0647\u0627\u06CC\u0631\u0627\u06CC\u0627\u0646\u0647 \u0631\u0627\u06CC\u0627\u0646\u0647 \u0631\u0648\u0645\u06CC\u0632\u06CC\u060C \u062F\u0633\u062A\u06AF\u0627\u0647\u200C\u0647\u0627\u06CC \u0628\u0627\u0632\u06CC \u0648\u06CC\u062F\u06CC\u0648\u06CC\u06CC\u060C \u067E\u062E\u0634 \u06A9\u0646\u0646\u062F\u0647\u200C\u0647\u0627\u06CC \u0628\u0644\u0648\u0631\u06CC\u060C \u0648 \u0633\u0627\u06CC\u0631 \u0633\u06A9\u0648\u0647\u0627 \u0631\u0627 \u0634\u0627\u0645\u0644 \u0645\u06CC\u200C\u0634\u0648\u062F.\
\n\n \u062C\u0627\u0648\u0627\u0627\u0641 \u0627\u06CC\u06A9\u0633\u060C \u0628\u0631 \u0645\u0628\u0646\u0627\u06CC \u0641\u0646\u0627\u0648\u0631\u06CC \u062C\u0627\u0648\u0627 \u0627\u06CC\u062C\u0627\u062F \u06AF\u0631\u062F\u06CC\u062F\u0647 \u0627\u0633\u062A. \u062F\u0631 \u0646\u06AF\u0627\u0631\u0634 \u0631\u0627\u06CC\u0627\u0646\u0647 \u0631\u0648\u0645\u06CC\u0632\u06CC\u060C \u0647\u0645 \u0627\u06A9\u0646\u0648\u0646 \u0627\u0632 \u0633\u06CC\u0633\u062A\u0645 \u0639\u0627\u0645\u0644\u200C\u0647\u0627\u06CC \u0648\u06CC\u0646\u062F\u0648\u0632 \u0627\u06A9\u0633\u200C\u067E\u06CC\u060C \u0648\u06CC\u0646\u062F\u0648\u0632 \u0648\u06CC\u0633\u062A\u0627\u060C \u0645\u06A9\u06CC\u0646\u062A\u0627\u0634\u060C \u067E\u0634\u062A\u06CC\u0628\u0627\u0646\u06CC \u0645\u06CC\u200C\u0646\u0645\u0627\u06CC\u062F. \u062F\u0631 \u0646\u06AF\u0627\u0631\u0634 \u062C\u0627\u0648\u0627 \u0627\u0641 \u0627\u06CC\u06A9\u0633 \u06F1\u066B\u06F2\u060C \u0633\u0627\u0646 \u0646\u0633\u062E\u0647\u200C\u0647\u0627\u06CC \u0627\u0648\u0644\u06CC\u0647\u200C\u0627\u06CC \u0631\u0627 \u0628\u0631\u0627\u06CC \u0644\u06CC\u0646\u0648\u06A9\u0633 \u0648 \u0627\u067E\u0646 \u0633\u0648\u0644\u0627\u0631\u06CC\u0633 \u0627\u0631\u0627\u06CC\u0647 \u0646\u0645\u0648\u062F.\
\n\n \u062F\u0631 \u0646\u06AF\u0627\u0631\u0634 \u0645\u0648\u0628\u0627\u06CC\u0644\u060C \u062C\u0627\u0648\u0627 \u0627\u0641 \u0627\u06CC\u06A9\u0633\u060C \u0642\u0627\u0628\u0644\u06CC\u062A \u0627\u062C\u0631\u0627\u06CC\u06CC \u062F\u0631 \u0633\u06CC\u0633\u062A\u0645 \u0639\u0627\u0645\u0644\u200C\u0647\u0627\u06CC\u06CC \u0686\u0648\u0646\u060C \u0633\u06CC\u0645\u0628\u06CC\u0627\u0646\u060C \u0648\u06CC\u0646\u062F\u0648\u0632 \u0645\u0648\u0628\u0627\u06CC\u0644\u060C \u0648 \u0633\u06CC\u0633\u062A\u0645 \u0639\u0627\u0645\u0644\u200C\u0647\u0627\u06CC \u0628\u06CC \u062F\u0631\u0646\u06AF \u0631\u0627 \u062F\u0627\u0631\u0627\u0633\u062A.\
\n\n \u0646\u06AF\u0627\u0631\u0634 \u06A9\u0646\u0648\u0646\u06CC \u0627\u06CC\u0646 \u0633\u06A9\u0648\u060C \u0634\u0627\u0645\u0644 \u0627\u062C\u0632\u0627 \u0632\u06CC\u0631 \u0627\u0633\u062A:\
\n\n     \u06A9\u06CC\u062A \u062A\u0648\u0633\u0639\u0647 \u0646\u0631\u0645\u200C\u0627\u0641\u0632\u0627\u0631 \u062C\u0627\u0648\u0627 \u0627\u0641 \u0627\u06CC\u06A9\u0633: \u06A9\u0647 \u0634\u0627\u0645\u0644 \u06A9\u0627\u0645\u067E\u0627\u06CC\u0644\u0631\u060C \u0627\u0628\u0632\u0627\u0631 \u0632\u0645\u0627\u0646 \u0627\u062C\u0631\u0627\u06CC\u06CC\u060C \u06AF\u0631\u0627\u0641\u06CC\u06A9\u06CC\u060C \u062E\u062F\u0645\u0627\u062A \u0631\u0633\u0627\u0646\u0647\u200C\u0627\u06CC \u0648\u0628 \u0648 \u06A9\u062A\u0627\u0628\u062E\u0627\u0646\u0647 \u063A\u0646\u06CC \u0645\u062A\u0646\u06CC \u0627\u0633\u062A.\
\n\n     \u0645\u062D\u06CC\u0637 \u062A\u0648\u0633\u0639\u0647 \u0646\u062A\u0628\u06CC\u0646\u0632 \u0628\u0631\u0627\u06CC \u062C\u0627\u0648\u0627 \u0627\u0641 \u0627\u06CC\u06A9\u0633: \u0646\u062A\u0628\u06CC\u0646\u0632 \u0627\u0645\u06A9\u0627\u0645 \u0627\u0636\u0627\u0641\u0647 \u06A9\u0631\u062F\u0646 \u0628\u0627 \u0627\u0633\u062A\u0641\u0627\u062F\u0647 \u0627\u0632 \u0635\u0641\u062D\u0647\u200C\u0627\u06CC \u0628\u0631\u0627\u06CC \u06A9\u0634\u06CC\u062F\u0646 \u0648 \u0631\u0647\u0627 \u06A9\u0631\u062F\u0646 \u0628\u0631\u0627\u06CC \u0627\u0636\u0627\u0641\u0647 \u0646\u0645\u0648\u062F\u0646 \u0627\u0634\u06CC\u0627\u06CC\u06CC \u0628\u0627 \u0642\u0627\u0628\u0644\u06CC\u062A \u062D\u0631\u06A9\u062A\u060C \u067E\u0648\u06CC\u0627\u0646\u0645\u0627\u06CC\u06CC \u0648 \u0647\u0645\u0686\u0646\u06CC\u0646 \u0645\u062C\u0645\u0648\u0639\u0647 \u0627\u0632 \u0646\u0645\u0648\u0646\u0647\u200C\u0647\u0627 \u0648 \u0645\u062B\u0627\u0644\u0647\u0627 \u0628\u0631\u0627\u06CC \u06CC\u0627\u062F\u06AF\u06CC\u0631\u06CC. \u0628\u0631\u0627\u06CC \u0627\u06A9\u0644\u06CC\u067E\u0633\u060C \u0627\u0641\u0632\u0648\u0646\u0647\u200C\u0627\u06CC \u062A\u062D\u062A \u062D\u0645\u0627\u06CC\u062A \u067E\u0631\u0648\u0698\u0647 \u06A9\u0646\u0627\u06CC\u06CC \u0648\u062C\u0648\u062F \u062F\u0627\u0631\u062F.\
\n\n     \u0627\u0628\u0632\u0627\u0631\u0647\u0627 \u0648 \u0627\u0641\u0631\u0648\u0646\u0647\u200C\u0647\u0627\u06CC\u06CC \u0628\u0631\u0627\u06CC \u06A9\u0627\u0631\u0647\u0627\u06CC \u062E\u0644\u0627\u0642: \u0627\u0641\u0632\u0648\u0646\u0647\u200C\u0647\u0627\u06CC\u06CC \u0628\u0631\u0627\u06CC \u062A\u0628\u062F\u06CC\u0644 \u06AF\u0631\u0627\u0641\u06CC\u06A9 \u0645\u0648\u062C\u0648\u062F \u062F\u0631 \u0627\u062F\u0648\u0628 \u0641\u0648\u062A\u0648\u0634\u0627\u067E \u0648 \u0627\u062F\u0648\u0628 \u0627\u06CC\u0644\u0633\u0641\u0642\u06CC\u062A\u0648\u0631 \u0628\u0647 \u06A9\u062F\u0647\u0627\u06CC \u062C\u0627\u0648\u0627 \u0627\u0641 \u0627\u06CC\u06A9\u0633 \u0631\u0627 \u062F\u0627\u0631\u0627\u0633\u062A. \u0627\u0628\u0632\u0627\u0631\u0647\u0627\u06CC\u06CC \u0628\u0631\u0627\u06CC \u062A\u0628\u062F\u06CC\u0644 \u0627\u0633 \u0648\u06CC \u062C\u06CC \u0628\u0647 \u06A9\u062F\u0647\u0627\u06CC \u062C\u0627\u0648\u0627 \u0627\u0641 \u0627\u06CC\u06A9\u0633.\
\n\n \u0635\u0627\u062D\u0628 \u0646\u0638\u0631\u0627\u0646 \u0628\u0631 \u0627\u06CC\u0646 \u0628\u0627\u0648\u0631\u0646\u062F \u06A9\u0647 \u0627\u06CC\u0646 \u0645\u062D\u0635\u0648\u0644 \u062F\u0631 \u0628\u0627\u0632\u0627\u0631 \u0633\u0627\u0645\u0627\u0646\u0647\u200C\u0647\u0627\u06CC \u0631\u0627\u06CC\u0627\u0646\u0647 \u0631\u0648\u0645\u06CC\u0632\u06CC\u060C \u0628\u0627 \u0645\u062D\u0635\u0648\u0644\u0627\u062A\u06CC \u0686\u0648\u062A \u0627\u062F\u0648\u0628 \u0641\u0644\u0634 \u067E\u0644\u06CC\u0631\u060C \u0627\u062F\u0648\u0628\u06CC \u0627\u06CC\u0631\u060C \u0627\u067E\u0646 \u0644\u0627\u0633\u0632\u0644\u0648 \u0648 \u0633\u06CC\u0644\u0648\u0631\u0644\u0627\u06CC\u062A \u0645\u0627\u06CC\u06A9\u0631\u0648\u0633\u0627\u0641\u062A\u060C \u062F\u0631 \u0631\u0642\u0627\u0628\u062A \u062E\u0648\u0627\u0647\u062F \u0628\u0648\u062F.\